In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sb

In [2]:
df = pd.read_csv('Salaries.csv')

/home/jalaj/.local/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3020: DtypeWarning: Columns (3,4,5,6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year
count  148654.000000  148654.000000     148654.000000  148654.000000
mean    74327.500000   74768.321972      93692.554811    2012.522643
std     42912.857795   50517.005274      62793.533483       1.117538
min         1.000000    -618.130000       -618.130000    2011.000000
25%     37164.250000   36168.995000      44065.650000    2012.000000
50%     74327.500000   71426.610000      92404.090000    2013.000000
75%    111490.750000  105839.135000     132876.450000    2014.000000
max    148654.000000  567595.430000     567595.430000    2014.000000

In [4]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,400184,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,382943,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,122541,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,254428,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,191972,326373.19,326373.19,2011,San Francisco

In [5]:
#printing missing values
print(df.isnull().sum())

Id                    0
EmployeeName          0
JobTitle              0
BasePay             605
OvertimePay           0
OtherPay              0
Benefits              0
TotalPay              0
TotalPayBenefits      0
Year                  0
Agency                0
dtype: int64

In [6]:
# Let's see how many examples we have of each species
df["Agency"].value_counts()

San Francisco    148654
Name: Agency, dtype: int64

In [7]:
df["JobTitle"].value_counts()

Transit Operator                                      7036
Special Nurse                                         4389
Registered Nurse                                      3736
Public Svc Aide-Public Works                          2518
Police Officer 3                                      2421
Custodian                                             2418
TRANSIT OPERATOR                                      2388
Firefighter                                           2359
Recreation Leader                                     1971
Patient Care Assistant                                1945
Deputy Sheriff                                        1933
Police Officer                                        1476
SPECIAL NURSE                                         1402
Public Service Trainee                                1328
REGISTERED NURSE                                      1219
Police Officer 2                                      1141
Attorney (Civil/Criminal)                             1126
Porter                                                1095
Sergeant 3                                            1047
General Laborer                                       1033
EMT/Paramedic/Firefighter                              918
Gardener                                               894
Parking Control Officer                                868
Senior Clerk                                           840
Library Page                                           799
CUSTODIAN                                              796
FIREFIGHTER                                            794
POLICE OFFICER III                                     779
Clerk                                                  764
Eligibility Worker                                     760
                                                      ...
LEGISLATIVE ASSISTANT, CITY ATTORNEY'S OFFICE            1
ORNAMENTAL IRON WORKER SUPERVISOR I                      1
INSTITUTIONAL POLICE LIEUTENANT                          1
Cfdntal Sctry to Distric Atty                            1
AIRPORT MECHANICAL MAINTENANCE SUPERVISOR                1
Chief Forensic Toxicologist                              1
Forensic Toxicologist Supervis                           1
PUBLIC DEFENDER                                          1
COURT ASSISTANT, SUPERIOR COURT                          1
MEDIA/SECURITY SYSTEMS SUPERVISOR                        1
COURT PARALEGAL                                          1
POWER GENERATION TECHNICIAN I                            1
IS TRAINER - SENIOR                                      1
DIRECTOR, EMPLOYEE RELATIONS DIVISION                    1
DEPUTY SEALER OF WEIGHTS AND MEASURES                    1
SECRETARY, HEALTH COMMISSION                             1
Head Airport Electrician                                 1
SECRETARY, LIBRARY COMMISSION                            1
COURT COMPUTER FACILITIES COORDINATOR                    1
SENIOR TRANSIT TRAFFIC CHECKER                           1
ASSISTANT INSPECTOR (POLICE DEPARTMENT)                  1
DIRECTOR, JUVENILE HALL                                  1
SENIOR SUPERVISING PROBATION OFFICER, JUVENILE POU       1
Public Service Aide-Technical                            1
ANIMAL CARE SUPERVISOR                                   1
ADMINISTRATOR, SFGH MEDICAL CENTER                       1
TREE TOPPER SUPERVISOR II                                1
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS           1
CARPENTER SUPERVISOR II                                  1
Musm Exhibit Packer & Repairer                           1
Name: JobTitle, Length: 2159, dtype: int64

In [8]:
df["Year"].value_counts()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

In [9]:
correlation = df.corr(method='pearson')
print(correlation)

                        Id  TotalPay  TotalPayBenefits      Year
Id                1.000000 -0.211478         -0.092190  0.968171
TotalPay         -0.211478  1.000000          0.977313  0.032090
TotalPayBenefits -0.092190  0.977313          1.000000  0.151947
Year              0.968171  0.032090          0.151947  1.000000

In [10]:
#print the contigency table between PetalWidth and Type to find chisquare value.
new_test_df = pd.crosstab(index=df['TotalPay'],columns=df['Year'],margins=True)
print(new_test_df)

Year        2011   2012   2013   2014     All
TotalPay
-618.13        0      0      0      1       1
0.0            3     25    288     52     368
0.3            1      0      0      0       1
1.77           0      1      0      0       1
1.83           0      0      0      1       1
3.28           0      1      0      0       1
4.17           1      0      0      0       1
4.75           0      1      0      0       1
5.56           0      0      1      0       1
5.8            1      0      0      0       1
6.0            0      0      0      1       1
7.6            0      0      1      0       1
8.86           1      0      0      0       1
9.98           0      0      2      0       2
10.67          0      0      1      0       1
10.69          0      0      3      0       3
12.78          0      0      0      1       1
12.89          0      0      0      1       1
13.35          0      0      0      1       1
13.77          0      0      0      1       1
14.26          0      0      1      0       1
15.29          0      1      0      0       1
15.35          0      0      0      1       1
15.36          0      0      0      1       1
15.5           0      0      0      1       1
15.83          0      0      3      0       3
16.09          0      0      0      1       1
17.26          0      0      0      1       1
17.42          1      0      0      0       1
17.78          1      0      0      0       1
...          ...    ...    ...    ...     ...
321552.11      0      1      0      0       1
321883.83      0      1      0      0       1
322143.1       0      0      0      1       1
322886.84      0      0      1      0       1
324820.63      0      0      1      0       1
326233.44      0      0      0      1       1
326373.19      1      0      0      0       1
326376.37      0      0      1      0       1
326716.76      0      0      0      1       1
327689.78      0      1      0      0       1
329390.54      0      0      0      1       1
332343.61      1      0      0      0       1
333888.32      0      0      1      0       1
335279.91      1      0      0      0       1
335484.96      0      0      0      1       1
335537.96      0      0      1      0       1
336393.73      0      1      0      0       1
336922.01      0      0      1      0       1
337204.86      0      1      0      0       1
339282.07      0      0      1      0       1
339653.7       0      0      0      1       1
344187.46      0      0      0      1       1
347102.32      0      0      1      0       1
350403.41      0      1      0      0       1
362844.66      0      1      0      0       1
390111.98      0      0      0      1       1
471952.64      0      0      0      1       1
538909.28      1      0      0      0       1
567595.43      1      0      0      0       1
All        36159  36766  37606  38123  148654

[138487 rows x 5 columns]

In [11]:
#group the data by the class
grouped_data = df.groupby(['Year'])
grouped_data['Year'].describe().unstack()

       Year
count  2011    36159.0
       2012    36766.0
       2013    37606.0
       2014    38123.0
mean   2011     2011.0
       2012     2012.0
       2013     2013.0
       2014     2014.0
std    2011        0.0
       2012        0.0
       2013        0.0
       2014        0.0
min    2011     2011.0
       2012     2012.0
       2013     2013.0
       2014     2014.0
25%    2011     2011.0
       2012     2012.0
       2013     2013.0
       2014     2014.0
50%    2011     2011.0
       2012     2012.0
       2013     2013.0
       2014     2014.0
75%    2011     2011.0
       2012     2012.0
       2013     2013.0
       2014     2014.0
max    2011     2011.0
       2012     2012.0
       2013     2013.0
       2014     2014.0
dtype: float64

In [12]:
# find 5-point summary
data = df['TotalPay']
quartiles = np.percentile(data, [25, 50, 75])
data_min, data_max = data.min(), data.max()
print("5-number summary for TotalPay")
print('Min: %.3f' % data_min)
print('Q1: %.3f' % quartiles[0])
print('Median: %.3f' % quartiles[1])
print('Q3: %.3f' % quartiles[2])
print('Max: %.3f' % data_max)

5-number summary for TotalPay
Min: -618.130
Q1: 36168.995
Median: 71426.610
Q3: 105839.135
Max: 567595.430

In [13]:
#Measuring Central Tendancy
grouped_data['TotalPay'].mean().reset_index()

   Year      TotalPay
0  2011  71744.103871
1  2012  74113.262265
2  2013  77611.443142
3  2014  75463.918140

In [14]:
grouped_data['TotalPay'].aggregate(np.mean).reset_index()

   Year      TotalPay
0  2011  71744.103871
1  2012  74113.262265
2  2013  77611.443142
3  2014  75463.918140

In [15]:
grouped_data['TotalPay'].median().reset_index()
grouped_data['TotalPay'].aggregate(np.median).reset_index()

   Year   TotalPay
0  2011  68213.240
1  2012  70714.680
2  2013  74500.015
3  2014  72359.980

In [16]:
#Measures of variability - Std Dev
grouped_data['TotalPay'].std().reset_index()

   Year      TotalPay
0  2011  47498.706594
1  2012  49523.904319
2  2013  52854.774783
3  2014  51697.713029

In [17]:
#IQR
grouped_data['TotalPay'].quantile([.25, .5, .75]).unstack()

            0.25       0.50        0.75
Year
2011  36810.7600  68213.240  102512.680
2012  37560.6075  70714.680  104099.170
2013  36754.9950  74500.015  109637.670
2014  33436.2100  72359.980  107974.445

In [18]:
#Variance
grouped_data['TotalPay'].var().reset_index()

   Year      TotalPay
0  2011  2.256127e+09
1  2012  2.452617e+09
2  2013  2.793627e+09
3  2014  2.672654e+09

In [19]:
df2 = df

In [20]:
bins = list()
for data in df2['TotalPay']:
    if int(data) <= 50000:
        bins.append("very low")
    elif (data > 50000) & (data <= 200000):
        bins.append("low")
    elif (data > 200000) & (data <= 350000):
        bins.append("medium")
    elif (data > 350000) & (data <= 500000):
        bins.append("high")
    else:
        bins.append("very high")

In [21]:
df2.TotalPay = bins

In [22]:
df2.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,400184,very high,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,382943,very high,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,122541,medium,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,254428,medium,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,191972,medium,326373.19,2011,San Francisco

In [23]:
df2['TotalPay'].value_counts()

low          100754
very low      45892
medium         2002
high              4
very high         2
Name: TotalPay, dtype: int64

In [24]:
test_df_2 = pd.crosstab(index=df2['TotalPay'],columns=df2['Year'],margins=True)
print(test_df_2)

Year        2011   2012   2013   2014     All
TotalPay
high           0      2      0      2       4
low        24440  25096  25625  25593  100754
medium       258    440    728    576    2002
very high      2      0      0      0       2
very low   11459  11228  11253  11952   45892
All        36159  36766  37606  38123  148654